dataset_gen/Hole_Location_Change/CE_KH_openfoam/Design_Point_0/0/p
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   nonuniform List<scalar>
16320
(
0.6396596640060677
0.6396596640060677
0.6396596640060677
0.6396596640060677
0.6396596640060677
0.6396596640060677
0.6396596640060677
0.6396596640060677
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
