dataset_gen/Hole_Location_Change/CE_KH_openfoam/Design_Point_0/0/rho
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object rho;
}

dimensions      [1 -3 0 0 0 0 0];
internalField   nonuniform List<scalar>
16320
(
0.5228049039345677
0.5228049039345677
0.5228049039345677
0.5228049039345677
0.5228049039345677
0.5228049039345677
0.5228049039345677
0.5228049039345677
...
)
;

boundaryField
{
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    top
    {
        type            cyclic;
    }
    hole
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}
